---
type: FamilyTypeSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# FamilyTypeSet

`Autodesk.Revit.DB.FamilyTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilyTypeSet | — | `public FamilyTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( FamilyType item )` |
| Method | Erase | — | `public virtual int Erase ( FamilyType item )` |
| Method | ForwardIterator | — | `public virtual FamilyTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( FamilyType item )` |
| Method | ReverseIterator | — | `public virtual FamilyTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |